import math
    ''' Имопртирует библиотеку math'''

def area(r):
    ''' Принимает радиус r, возвращает площадь круга по формуле `S = π*r²`

        Параметры:
        - `r` : Радиус круга

        Возвращаемое значение:
        - `pi * r ** 2` : Площадь круга'''
    return math.pi * r * r


def perimeter(r):
    ''' Принимает радиус r, возвращает длину окружности по формуле `C = 2*π*r`

        Параметры:
        - `r` : Радиус круга

        Возвращаемое значение:
        - `2 * pi * r` : Длина окружности'''
    return 2 * math.pi * r

