def area(a, b):
    ''' Принимает две стороны прямоугольника и возвращает площадь по формуле S = ab

        Параметры:
        a (int) : Первая сторона прямоугольника 
        b (int) : Вторая сторона прямоугольника

        Возвращаемое значение:
        a*b (int) : Площадь прямоугольника '''
    return a * b

def perimeter(a, b):
    ''' Принимает две стороны прямоугольника и возвращает периметр по формуле P = 2*(a+b)

        Параметры:
        a (int) : Первая сторона прямоугольника 
        b (int) : Вторая сторона прямоугольника

        Возвращаемое значение:
        2*(a+b) (int) : Периметр прямоугольника '''
    return 2*(a + b)