def area(a, b):
    ''' Принимает стороны a и b, возвращает площадь прямоугольника по формуле `S = a*b`

        Параметры:
        - `a` : Длина прямоугольника
        - `b` : Ширина прямоугольника

        Возвращаемое значение:
        - `a*b` : Площадь прямоугольника'''
    return a * b

def perimeter(a, b):
    ''' Принимает стороны a и b, возвращает периметр прямоугольника по формуле `P = 2*(a+b)`

        Параметры:
        - `a` : Длина прямоугольника
        - `b` : Ширина прямоугольника

        Возвращаемое значение:
        - `2*(a+b)` : Периметр прямоугольника'''
    return 2*(a + b)