def area(a, h):
    ''' Принимает основание a и высоту h, возвращает площадь треугольника по формуле `S = a*h/2`

        Параметры:
        - `a` : Основание треугольника
        - `h` : Высота треугольника

        Возвращаемое значение:
        - `a*h/2` : Площадь треугольника'''
    return a * h / 2

def perimeter(a, b, c):
    ''' Принимает стороны a, b и c, возвращает периметр треугольника по формуле `P = a+b+c`

        Параметры:
        - `a` : 1-ая сторона треугольника
        - `b` : 2-ая сторона треугольника
        - `c` : 3-яя сторона треугольника

        Возвращаемое значение:
        - `a+b+c` : Периметр треугольника'''
    return a + b + c