def area(a, h):
    ''' Принимает основание a и высоту h, возвращает площадь треугольника по формуле S = a*h/2.
    
    Параметры:
    a (int) : Основание треугольника
    h (int) : Высота треугольника

    Возвращаемое значение:
    a*h/2 (int) : Площадь треугольника '''
    return a * h / 2

def perimeter(a, b, c):
    ''' Принимает стороны a,b и c, возвращает периметр треугольника по формуле P = a+b+c.
    
    Параметры:
    a (int) : 1-ая сторона треугольника
    b (int) : 2-ая сторона треугольника
    c (int) : 3-яя сторона треугольника

    Возвращаемое значение:
    a+b+c (int) : Периметр треугольника '''
    return a + b + c